; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v5 - type_2 ?v2 - type_1)
 	      (pred_2 ?v7 - object ?v2 - type_1)
	      (pred_3 ?v5 - type_2 ?v6 - type_3)
	      (pred_4 ?v5 - type_2 ?v7 - object ?v6 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v8)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_2 ?v4 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v3) (pred_1 ?v5 ?v3) (pred_3 ?v5 ?v6))
       :effect (and (pred_4 ?v5 ?v4 ?v6)
		    (not (pred_2 ?v4 ?v3)) 
		    (not (pred_3 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v4 - object ?v3 - type_1 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v5 ?v4 ?v6) (pred_1 ?v5 ?v3))
       :effect (and (pred_2 ?v4 ?v3)
		    (pred_3 ?v5 ?v6)
		    (not (pred_4 ?v5 ?v4 ?v6)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_01 obj_14 - type_2
obj_07 obj_04 obj_12 obj_11 - type_3
obj_03 obj_05 obj_08 obj_06 - type_1
obj_10 obj_02 obj_13 obj_09 - object)
(:init
(pred_1 obj_01 obj_03)
(pred_3 obj_01 obj_07)
(pred_3 obj_01 obj_04)
(pred_1 obj_14 obj_06)
(pred_3 obj_14 obj_12)
(pred_3 obj_14 obj_11)
(pred_2 obj_10 obj_08)
(pred_2 obj_02 obj_05)
(pred_2 obj_13 obj_05)
(pred_2 obj_09 obj_03)
)
(:goal
(and
(pred_2 obj_10 obj_08)
(pred_2 obj_02 obj_05)
(pred_2 obj_13 obj_05)
(pred_2 obj_09 obj_08)
)
)

(:constraints
  (always (not (pred_1 obj_01 obj_08)))
)
)

; plan
1. (op_1 obj_14 obj_06 obj_03)
   deleted: (pred_1 obj_14 obj_06)
   added: (pred_1 obj_14 obj_03)
   goals met: 3 of 4
2. (op_2 obj_14 obj_09 obj_03 obj_11)
   deleted: (pred_2 obj_09 obj_03) (pred_3 obj_14 obj_11)
   added: (pred_4 obj_14 obj_09 obj_11)
   goals met: 3 of 4
3. (op_1 obj_14 obj_03 obj_08)
   deleted: (pred_1 obj_14 obj_03)
   added: (pred_1 obj_14 obj_08)
   goals met: 3 of 4
4. (op_3 obj_14 obj_09 obj_08 obj_11)
   deleted: (pred_4 obj_14 obj_09 obj_11)
   added: (pred_2 obj_09 obj_08) (pred_3 obj_14 obj_11)
   goals met: 4 of 4
